PMo_manipulated/Graphviz/47.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "select course" -> "free spots?";
  "system shows\nparallel courses and\ndates" -> "select specific\ncourse";
  "check if registered\nat eligible\nuniversity" -> "eligible university?";
  "eligible university?" -> "request activation" [label="no"];
  "request activation" -> "system checks\neligibility";
  "system checks\neligibility" -> "person eligible?";
  "connect to twitter\naccount" -> "invite friends to\ncourse";
  "free spots?" -> "system shows\nparallel courses and\ndates" [label="yes"];
  "already registered?" -> "check if registered\nat eligible\nuniversity" [label="no"];
  "log into account" -> "ParallelGateway_1";
  "check if another\ncourse is\ninteresting" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "system issues course\ntickets";
  "invite friends to\ncourse" -> "ParallelGateway_2";
  "provide payment info" -> "ParallelGateway_2";
  "free spots?" -> "check if another\ncourse is\ninteresting" [label="no"];
  "select specific\ncourse" -> "already registered?";
  "wish to enroll in\ncourse" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "select course";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2" [label="yes"];
  "system issues course\ntickets" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "end process";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3" [label="no"];
  "person eligible?" -> "ExclusiveGateway_4" [label="no"];
  "ParallelGateway_1" -> "provide payment info";
  "ExclusiveGateway_5" -> "register account";
  "already registered?" -> "ExclusiveGateway_6" [label="yes"];
  "ExclusiveGateway_6" -> "log into account";
  "register account" -> "ExclusiveGateway_6";
  "person eligible?" -> "ExclusiveGateway_5" [label="yes"];
  "eligible university?" -> "ExclusiveGateway_5" [label="yes"];
  "check if registered\nat eligible\nuniversity" -> "request activation";

  "wish to enroll in\ncourse" [shape=circle];
  "end process" [shape=circle, penwidth=4];
  "free spots?" [shape=diamond];
  "already registered?" [shape=diamond];
  "eligible university?" [shape=diamond];
  "person eligible?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
