pmo-dataset/variations/mermaid_basic/47.mmd
graph LR
	Task_1["select course"] --> ExclusiveGateway_1{"free spots?"}
	Task_11["system shows parallel courses and dates"] --> Task_2["select specific course"]
	Task_3["check if registered at eligible university"] --> ExclusiveGateway_3{"eligible university?"}
	ExclusiveGateway_3 -->|"no"| Task_6["request activation"]
	Task_6 --> Task_12["system checks eligibility"]
	Task_12 --> ExclusiveGateway_4{"person eligible?"}
	Task_7["connect to twitter account"] --> Task_8["invite friends to course"]
	ExclusiveGateway_1 -->|"yes"| Task_11
	ExclusiveGateway_2{"already registered?"} -->|"no"| Task_3
	Task_4["log into account"] --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Task_7
	Task_10["check if another course is interesting"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_2{"+"} --> Task_13["system issues course tickets"]
	Task_8 --> ParallelGateway_2
	Task_9["provide payment info"] --> ParallelGateway_2
	ExclusiveGateway_1 -->|"no"| Task_10
	Task_2 --> ExclusiveGateway_2
	StartEvent_1(("wish to enroll in course")) --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_6 --> Task_1
	ExclusiveGateway_5 -->|"yes"| ExclusiveGateway_6
	Task_13 --> ExclusiveGateway_7{"X"}
	ExclusiveGateway_7 --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_8 --> EndEvent_1(("end process"))
	ExclusiveGateway_5 -->|"no"| ExclusiveGateway_7
	ExclusiveGateway_4 -->|"no"| ExclusiveGateway_8
	ParallelGateway_1 --> Task_9
	ExclusiveGateway_9{"X"} --> Task_5["register account"]
	ExclusiveGateway_2 -->|"yes"| ExclusiveGateway_10{"X"}
	ExclusiveGateway_10 --> Task_4
	Task_5 --> ExclusiveGateway_10
	ExclusiveGateway_4 -->|"yes"| ExclusiveGateway_9
	ExclusiveGateway_3 -->|"yes"| ExclusiveGateway_9
